Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb1.h
// SECCFGR16 Configuration

#define GTZC1_MPCBB1_SECCFGR16_SEC31    (0x1U<<31)
#define GTZC1_MPCBB1_SECCFGR16_SEC30    (0x1U<<30)
#define GTZC1_MPCBB1_SECCFGR16_SEC29    (0x1U<<29)
#define GTZC1_MPCBB1_SECCFGR16_SEC28    (0x1U<<28)
#define GTZC1_MPCBB1_SECCFGR16_SEC27    (0x1U<<27)
#define GTZC1_MPCBB1_SECCFGR16_SEC26    (0x1U<<26)
#define GTZC1_MPCBB1_SECCFGR16_SEC25    (0x1U<<25)
#define GTZC1_MPCBB1_SECCFGR16_SEC24    (0x1U<<24)
#define GTZC1_MPCBB1_SECCFGR16_SEC23    (0x1U<<23)
#define GTZC1_MPCBB1_SECCFGR16_SEC22    (0x1U<<22)
#define GTZC1_MPCBB1_SECCFGR16_SEC21    (0x1U<<21)
#define GTZC1_MPCBB1_SECCFGR16_SEC20    (0x1U<<20)
#define GTZC1_MPCBB1_SECCFGR16_SEC19    (0x1U<<19)
#define GTZC1_MPCBB1_SECCFGR16_SEC18    (0x1U<<18)
#define GTZC1_MPCBB1_SECCFGR16_SEC17    (0x1U<<17)
#define GTZC1_MPCBB1_SECCFGR16_SEC16    (0x1U<<16)
#define GTZC1_MPCBB1_SECCFGR16_SEC15    (0x1U<<15)
#define GTZC1_MPCBB1_SECCFGR16_SEC14    (0x1U<<14)
#define GTZC1_MPCBB1_SECCFGR16_SEC13    (0x1U<<13)
#define GTZC1_MPCBB1_SECCFGR16_SEC12    (0x1U<<12)
#define GTZC1_MPCBB1_SECCFGR16_SEC11    (0x1U<<11)
#define GTZC1_MPCBB1_SECCFGR16_SEC10    (0x1U<<10)
#define GTZC1_MPCBB1_SECCFGR16_SEC9     (0x1U<<9)
#define GTZC1_MPCBB1_SECCFGR16_SEC8     (0x1U<<8)
#define GTZC1_MPCBB1_SECCFGR16_SEC7     (0x1U<<7)
#define GTZC1_MPCBB1_SECCFGR16_SEC6     (0x1U<<6)
#define GTZC1_MPCBB1_SECCFGR16_SEC5     (0x1U<<5)
#define GTZC1_MPCBB1_SECCFGR16_SEC4     (0x1U<<4)
#define GTZC1_MPCBB1_SECCFGR16_SEC3     (0x1U<<3)
#define GTZC1_MPCBB1_SECCFGR16_SEC2     (0x1U<<2)
#define GTZC1_MPCBB1_SECCFGR16_SEC1     (0x1U<<1)
#define GTZC1_MPCBB1_SECCFGR16_SEC0     (0x1U<<0)

// SECCFGR17 Configuration

#define GTZC1_MPCBB1_SECCFGR17_SEC31    (0x1U<<31)
#define GTZC1_MPCBB1_SECCFGR17_SEC30    (0x1U<<30)
#define GTZC1_MPCBB1_SECCFGR17_SEC29    (0x1U<<29)
#define GTZC1_MPCBB1_SECCFGR17_SEC28    (0x1U<<28)
#define GTZC1_MPCBB1_SECCFGR17_SEC27    (0x1U<<27)
#define GTZC1_MPCBB1_SECCFGR17_SEC26    (0x1U<<26)
#define GTZC1_MPCBB1_SECCFGR17_SEC25    (0x1U<<25)
#define GTZC1_MPCBB1_SECCFGR17_SEC24    (0x1U<<24)
#define GTZC1_MPCBB1_SECCFGR17_SEC23    (0x1U<<23)
#define GTZC1_MPCBB1_SECCFGR17_SEC22    (0x1U<<22)
#define GTZC1_MPCBB1_SECCFGR17_SEC21    (0x1U<<21)
#define GTZC1_MPCBB1_SECCFGR17_SEC20    (0x1U<<20)
#define GTZC1_MPCBB1_SECCFGR17_SEC19    (0x1U<<19)
#define GTZC1_MPCBB1_SECCFGR17_SEC18    (0x1U<<18)
#define GTZC1_MPCBB1_SECCFGR17_SEC17    (0x1U<<17)
#define GTZC1_MPCBB1_SECCFGR17_SEC16    (0x1U<<16)
#define GTZC1_MPCBB1_SECCFGR17_SEC15    (0x1U<<15)
#define GTZC1_MPCBB1_SECCFGR17_SEC14    (0x1U<<14)
#define GTZC1_MPCBB1_SECCFGR17_SEC13    (0x1U<<13)
#define GTZC1_MPCBB1_SECCFGR17_SEC12    (0x1U<<12)
#define GTZC1_MPCBB1_SECCFGR17_SEC11    (0x1U<<11)
#define GTZC1_MPCBB1_SECCFGR17_SEC10    (0x1U<<10)
#define GTZC1_MPCBB1_SECCFGR17_SEC9     (0x1U<<9)
#define GTZC1_MPCBB1_SECCFGR17_SEC8     (0x1U<<8)
#define GTZC1_MPCBB1_SECCFGR17_SEC7     (0x1U<<7)
#define GTZC1_MPCBB1_SECCFGR17_SEC6     (0x1U<<6)
#define GTZC1_MPCBB1_SECCFGR17_SEC5     (0x1U<<5)
#define GTZC1_MPCBB1_SECCFGR17_SEC4     (0x1U<<4)
#define GTZC1_MPCBB1_SECCFGR17_SEC3     (0x1U<<3)
#define GTZC1_MPCBB1_SECCFGR17_SEC2     (0x1U<<2)
#define GTZC1_MPCBB1_SECCFGR17_SEC1     (0x1U<<1)
#define GTZC1_MPCBB1_SECCFGR17_SEC0     (0x1U<<0)

// SECCFGR18 Configuration

#define GTZC1_MPCBB1_SECCFGR18_SEC31    (0x1U<<31)
#define GTZC1_MPCBB1_SECCFGR18_SEC30    (0x1U<<30)
#define GTZC1_MPCBB1_SECCFGR18_SEC29    (0x1U<<29)
#define GTZC1_MPCBB1_SECCFGR18_SEC28    (0x1U<<28)
#define GTZC1_MPCBB1_SECCFGR18_SEC27    (0x1U<<27)
#define GTZC1_MPCBB1_SECCFGR18_SEC26    (0x1U<<26)
#define GTZC1_MPCBB1_SECCFGR18_SEC25    (0x1U<<25)
#define GTZC1_MPCBB1_SECCFGR18_SEC24    (0x1U<<24)
#define GTZC1_MPCBB1_SECCFGR18_SEC23    (0x1U<<23)
#define GTZC1_MPCBB1_SECCFGR18_SEC22    (0x1U<<22)
#define GTZC1_MPCBB1_SECCFGR18_SEC21    (0x1U<<21)
#define GTZC1_MPCBB1_SECCFGR18_SEC20    (0x1U<<20)
#define GTZC1_MPCBB1_SECCFGR18_SEC19    (0x1U<<19)
#define GTZC1_MPCBB1_SECCFGR18_SEC18    (0x1U<<18)
#define GTZC1_MPCBB1_SECCFGR18_SEC17    (0x1U<<17)
#define GTZC1_MPCBB1_SECCFGR18_SEC16    (0x1U<<16)
#define GTZC1_MPCBB1_SECCFGR18_SEC15    (0x1U<<15)
#define GTZC1_MPCBB1_SECCFGR18_SEC14    (0x1U<<14)
#define GTZC1_MPCBB1_SECCFGR18_SEC13    (0x1U<<13)
#define GTZC1_MPCBB1_SECCFGR18_SEC12    (0x1U<<12)
#define GTZC1_MPCBB1_SECCFGR18_SEC11    (0x1U<<11)
#define GTZC1_MPCBB1_SECCFGR18_SEC10    (0x1U<<10)
#define GTZC1_MPCBB1_SECCFGR18_SEC9     (0x1U<<9)
#define GTZC1_MPCBB1_SECCFGR18_SEC8     (0x1U<<8)
#define GTZC1_MPCBB1_SECCFGR18_SEC7     (0x1U<<7)
#define GTZC1_MPCBB1_SECCFGR18_SEC6     (0x1U<<6)
#define GTZC1_MPCBB1_SECCFGR18_SEC5     (0x1U<<5)
#define GTZC1_MPCBB1_SECCFGR18_SEC4     (0x1U<<4)
#define GTZC1_MPCBB1_SECCFGR18_SEC3     (0x1U<<3)
#define GTZC1_MPCBB1_SECCFGR18_SEC2     (0x1U<<2)
#define GTZC1_MPCBB1_SECCFGR18_SEC1     (0x1U<<1)
#define GTZC1_MPCBB1_SECCFGR18_SEC0     (0x1U<<0)

// SECCFGR19 Configuration

#define GTZC1_MPCBB1_SECCFGR19_SEC31    (0x1U<<31)
#define GTZC1_MPCBB1_SECCFGR19_SEC30    (0x1U<<30)
#define GTZC1_MPCBB1_SECCFGR19_SEC29    (0x1U<<29)
#define GTZC1_MPCBB1_SECCFGR19_SEC28    (0x1U<<28)
#define GTZC1_MPCBB1_SECCFGR19_SEC27    (0x1U<<27)
#define GTZC1_MPCBB1_SECCFGR19_SEC26    (0x1U<<26)
#define GTZC1_MPCBB1_SECCFGR19_SEC25    (0x1U<<25)
#define GTZC1_MPCBB1_SECCFGR19_SEC24    (0x1U<<24)
#define GTZC1_MPCBB1_SECCFGR19_SEC23    (0x1U<<23)
#define GTZC1_MPCBB1_SECCFGR19_SEC22    (0x1U<<22)
#define GTZC1_MPCBB1_SECCFGR19_SEC21    (0x1U<<21)
#define GTZC1_MPCBB1_SECCFGR19_SEC20    (0x1U<<20)
#define GTZC1_MPCBB1_SECCFGR19_SEC19    (0x1U<<19)
#define GTZC1_MPCBB1_SECCFGR19_SEC18    (0x1U<<18)
#define GTZC1_MPCBB1_SECCFGR19_SEC17    (0x1U<<17)
#define GTZC1_MPCBB1_SECCFGR19_SEC16    (0x1U<<16)
#define GTZC1_MPCBB1_SECCFGR19_SEC15    (0x1U<<15)
#define GTZC1_MPCBB1_SECCFGR19_SEC14    (0x1U<<14)
#define GTZC1_MPCBB1_SECCFGR19_SEC13    (0x1U<<13)
#define GTZC1_MPCBB1_SECCFGR19_SEC12    (0x1U<<12)
#define GTZC1_MPCBB1_SECCFGR19_SEC11    (0x1U<<11)
#define GTZC1_MPCBB1_SECCFGR19_SEC10    (0x1U<<10)
#define GTZC1_MPCBB1_SECCFGR19_SEC9     (0x1U<<9)
#define GTZC1_MPCBB1_SECCFGR19_SEC8     (0x1U<<8)
#define GTZC1_MPCBB1_SECCFGR19_SEC7     (0x1U<<7)
#define GTZC1_MPCBB1_SECCFGR19_SEC6     (0x1U<<6)
#define GTZC1_MPCBB1_SECCFGR19_SEC5     (0x1U<<5)
#define GTZC1_MPCBB1_SECCFGR19_SEC4     (0x1U<<4)
#define GTZC1_MPCBB1_SECCFGR19_SEC3     (0x1U<<3)
#define GTZC1_MPCBB1_SECCFGR19_SEC2     (0x1U<<2)
#define GTZC1_MPCBB1_SECCFGR19_SEC1     (0x1U<<1)
#define GTZC1_MPCBB1_SECCFGR19_SEC0     (0x1U<<0)

