Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb1.h
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB1_PRIVCFGR18_PRIV0   (0x1U<<0)

// PRIVCFGR19 Configuration

#define GTZC1_MPCBB1_PRIVCFGR19_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB1_PRIVCFGR19_PRIV0   (0x1U<<0)

// PRIVCFGR20 Configuration

#define GTZC1_MPCBB1_PRIVCFGR20_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB1_PRIVCFGR20_PRIV0   (0x1U<<0)

// PRIVCFGR21 Configuration

#define GTZC1_MPCBB1_PRIVCFGR21_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB1_PRIVCFGR21_PRIV0   (0x1U<<0)

// PRIVCFGR22 Configuration

#define GTZC1_MPCBB1_PRIVCFGR22_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB1_PRIVCFGR22_PRIV0   (0x1U<<0)

// PRIVCFGR23 Configuration

#define GTZC1_MPCBB1_PRIVCFGR23_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB1_PRIVCFGR23_PRIV0   (0x1U<<0)

