Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_gtzc1_mpcbb1.h
// PRIVCFGR48 Configuration

#define GTZC1_MPCBB1_PRIVCFGR48_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB1_PRIVCFGR48_PRIV0   (0x1U<<0)

// PRIVCFGR49 Configuration

#define GTZC1_MPCBB1_PRIVCFGR49_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB1_PRIVCFGR49_PRIV0   (0x1U<<0)

// PRIVCFGR50 Configuration

#define GTZC1_MPCBB1_PRIVCFGR50_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB1_PRIVCFGR50_PRIV0   (0x1U<<0)

// PRIVCFGR51 Configuration

#define GTZC1_MPCBB1_PRIVCFGR51_PRIV31  (0x1U<<31)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV30  (0x1U<<30)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV29  (0x1U<<29)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV28  (0x1U<<28)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV27  (0x1U<<27)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV26  (0x1U<<26)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV25  (0x1U<<25)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV24  (0x1U<<24)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV23  (0x1U<<23)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV22  (0x1U<<22)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV21  (0x1U<<21)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV20  (0x1U<<20)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV19  (0x1U<<19)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV18  (0x1U<<18)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV17  (0x1U<<17)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV16  (0x1U<<16)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV15  (0x1U<<15)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV14  (0x1U<<14)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV13  (0x1U<<13)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV12  (0x1U<<12)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV11  (0x1U<<11)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV10  (0x1U<<10)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV9   (0x1U<<9)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV8   (0x1U<<8)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV7   (0x1U<<7)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV6   (0x1U<<6)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV5   (0x1U<<5)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV4   (0x1U<<4)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV3   (0x1U<<3)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV2   (0x1U<<2)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV1   (0x1U<<1)
#define GTZC1_MPCBB1_PRIVCFGR51_PRIV0   (0x1U<<0)
